<?php
$menuTitles_level_1 = [
    [
        'text' => 'Пакеты подарочные',
        'children' => [

        ]
    ],
    [
        'text' => 'Стекло и керамика',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Сковородки, кастрюли,<br> протвени',
        'children' => [

        ]
    ],
    [
        'text' => 'Аксесуары для кухни',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Ведра миски та корзины<br> для мусора',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Набори для туалета',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Наборы для ванной',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Уборка',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Хозгруппa',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Горшки пластмасовые<br> и керамические',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Все для отдыха на природе',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Клей, скотч, ленты,<br> уплотнители',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Пена, силикон',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Сверлильные и<br> шлифовальные расходники',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Рулетки, уровни, правила,<br> угольники',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Молотки, топоры, гвоздодёры',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Ножовки, секаторы, пилочки,<br> стаместки',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Отвертки, ключи',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Слесарный инструмент, ножи,<br> напильники',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Пистолеты, степлера,<br> заклёпочники',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Перчатки, очки, респираторы<br> и др.',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Резинки, стеклорезы, тросы<br> д/канализации',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Газ, горелки, плитки, сварка',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Ведра, тазы',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Шпателя, крестики',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Малярный инструмент',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Штукатурный инструмент',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Инструмент для сада и<br> огорода, печное',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Аэрозольные краски',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Вилки, переходники,<br> тройники...',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Выключатели и розетки',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Колодки, удлинители, сетевые<br> фильтры',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Лампы LED, светильники,<br> прожектора,  ночники',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Паяльные наборы',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Пистолеты клеевые',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Ножи выкидные',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Фонарики,  батарейки,<br> калькуляторы, звонки',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Замки врезные и накладные',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Замки навесные',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Цилиндровые механизмы<br> (12шт/уп)',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Дверная и мебельная<br> фурнитура',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Петли евро',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Петли, стрелы Украина',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Почтовые ящики',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Ручки, шпингалеты, крючки',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Уголки, ключины, подвес<br> мебельный',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],

];

$menuTitles_level_2 = [
    [
        'text' => 'Пакеты подарочные',
        'children' => [

        ]
    ],
    [
        'text' => 'Стекло и керамика',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Сковородки, кастрюли,<br> протвени',
        'children' => [

        ]
    ],
    [
        'text' => 'Аксесуары для кухни',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Ведра миски та корзины<br> для мусора',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Набори для туалета',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Наборы для ванной',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Уборка',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Хозгруппa',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Горшки пластмасовые<br> и керамические',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Все для отдыха на природе',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Клей, скотч, ленты,<br> уплотнители',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Пена, силикон',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Сверлильные и<br> шлифовальные расходники',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Рулетки, уровни, правила,<br> угольники',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Молотки, топоры, гвоздодёры',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Ножовки, секаторы, пилочки,<br> стаместки',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Отвертки, ключи',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Слесарный инструмент, ножи,<br> напильники',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Пистолеты, степлера,<br> заклёпочники',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Перчатки, очки, респираторы<br> и др.',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Резинки, стеклорезы, тросы<br> д/канализации',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Газ, горелки, плитки, сварка',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Ведра, тазы',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Шпателя, крестики',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Малярный инструмент',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Штукатурный инструмент',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Инструмент для сада и<br> огорода, печное',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Аэрозольные краски',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Вилки, переходники,<br> тройники...',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Выключатели и розетки',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Колодки, удлинители, сетевые<br> фильтры',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Лампы LED, светильники,<br> прожектора,  ночники',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Паяльные наборы',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Пистолеты клеевые',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Ножи выкидные',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Фонарики,  батарейки,<br> калькуляторы, звонки',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Замки врезные и накладные',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Замки навесные',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Цилиндровые механизмы<br> (12шт/уп)',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Дверная и мебельная<br> фурнитура',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Петли евро',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Петли, стрелы Украина',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Почтовые ящики',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Ручки, шпингалеты, крючки',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],
    [
        'text' => 'Уголки, ключины, подвес<br> мебельный',
        'children' => [
            'Подкатегория 1',
            'Подкатегория 1',
        ]
    ],

];
?>

<div class="mainMenu" id="mainMenu">
    <div class="mainMenu__title">Каталог товаров</div>
    <ul class="mainMenu__list">
        <?php foreach ($menuTitles_level_1 as $menuTitle_level_1 => $menuTitle_level_1_i) { ?>

            <li class="mainMenu__listItem level__1">

                <?php if ( !empty( $menuTitle_level_1_i['children'] ) ) { ?>

                    <a href="#" class="mainMenu__link hasChildren">
                        <?php echo $menuTitle_level_1_i['text']; ?>
                        <i class="mainMenu__arrow"></i>
                    </a>

                <?php } else { ?>

                    <a href="#" class="mainMenu__link">
                        <?php echo $menuTitle_level_1_i['text']; ?>
                    </a>

                <?php } ?>
                <ul class="mainMenu__list__level2">

                    <li class="mainMenu__listItemLevel_2_wrap">
                        <ul class="mainMenu__listLevel_2_column">

                            <?php $subcat_i = 1; ?>

                            <?php foreach ( $menuTitles_level_2 as $menuTitle_level_2 => $menuTitle_level_2_i ) { ?>

                            <li class="mainMenu__listItem level__2">

                                <?php if ( !empty( $menuTitle_level_2_i['children'] ) ) { ?>

                                    <a href="#" class="mainMenu__link hasChildren">
                                        <?php echo $menuTitle_level_2_i['text'] . $subcat_i; ?>
                                        <i class="mainMenu__arrow"></i>
                                    </a>

                                <?php } else { ?>

                                    <a href="#" class="mainMenu__link">
                                        <?php echo $menuTitle_level_2_i['text'] . $subcat_i; ?>
                                    </a>

                                <?php } ?>

                                <?php
                                if ( !empty( $menuTitle_level_2_i['children'] ) ) {
                                    ?>
                                    <ul class="mainMenu__list__level_3">
                                        <?php
                                        foreach ( $menuTitle_level_2_i['children'] as $menuTitle__level_3 ) {
                                            ?>
                                            <li class="mainMenu__listItem_level_3">
                                                <a href="/?p=category" class="mainMenu__link_level_3"><?php echo $menuTitle__level_3; ?></a>
                                            </li>
                                            <?php
                                        }
                                        ?>

                                    </ul>
                                    <?php
                                }
                                ?>

                            </li>

                            <?php if ( $subcat_i % 16 == 0 ) { ?>
                        </ul>
                        <ul class="mainMenu__listLevel_2_column">
                            <?php } ?>

                            <?php $subcat_i++; ?>

                            <?php } ?>
                        </ul><!-- mainMenu__listLevel_2_column End -->
                    </li><!-- mainMenu__listItemLevel_2_wrap End -->
                </ul>
            </li>

        <?php } ?>
    </ul>

    <div class="mainMenu__btnHiddenWrap">
        <div class="mainMenu__btnHidden">Смотреть ещё товары</div>
    </div>
</div>
